/**
 ****************************************************************************************************
 * @file        sw.h
 * @author      正点原子团队(ALIENTEK)
 * @version     V1.0
 * @date        2024-01-01
 * @brief       SW-18010P震动传感器 驱动代码
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 * @attention
 *
 * 实验平台:正点原子 STM32F103开发板
 * 在线视频:www.yuanzige.com
 * 技术论坛:www.openedv.com
 * 公司网址:www.alientek.com
 * 购买地址:openedv.taobao.com
 *
 * 修改说明
 * V1.0 20240101
 * 第一次发布
 *
 ****************************************************************************************************
 */

#ifndef __SW_H
#define __SW_H

#include "./SYSTEM/sys/sys.h"

/******************************************************************************************/
/* SW-18010P 引脚 定义 */

#define SW_DO_GPIO_PORT                  GPIOC
#define SW_DO_GPIO_PIN                   SYS_GPIO_PIN6
#define SW_DO_GPIO_CLK_ENABLE()          do{ RCC->APB2ENR |= 1 << 4; }while(0)   /* PC口时钟使能 */

/******************************************************************************************/
/* IO操作函数 */
#define SW_DO_IN         sys_gpio_pin_get(SW_DO_GPIO_PORT, SW_DO_GPIO_PIN)     /* 读取SW-18010P数字输出引脚 */

/******************************************************************************************/
/* 函数声明 */
void sw_init(void);                      /* 初始化SW-18010P */
uint8_t sw_get_status(void);             /* 获取SW-18010P状态: 0-无震动, 1-检测到震动 */

#endif

